[Dégrouper les données d'un tableau Excel par formule Python](https://www.youtube.com/watch?v=nGj91Kmrdio&list=PLpQBnWleLAauKmgcdndmEr81iIIoW9_Wi&index=25)

Date : 11/06/2025

In [1]:
import pandas as pd

In [10]:
tab = pd.read_excel('data/Melt.xlsx', sheet_name='Feuil1')
tab.head().transpose()

                   0    1         2        3      4
ID                 1    2         3        4      5
Nom            Alice  Bob  Antoinne  Etienne  Médhi
Maths             85   90        69       95     85
Science           88   92        50       76     75
Programmation     72   85        90       57     95

Dégroupage des données

In [8]:
tab.melt(['ID', 'Nom'], 
         ['Maths', 'Science', 'Programmation'],
         'Sujet',
         'Score').sort_values(by=['Sujet', 'Nom'], ascending=True
                              ).reset_index(drop=True).transpose()

,0,1,2,3,4,5,6,7,8,9,...,20,21,22,23,24,25,26,27,28,29
ID,1,3,2,6,10,4,9,8,7,5,...,1,3,2,6,10,4,9,8,7,5
Nom,Alice,Antoinne,Bob,Carinne,Charline,Etienne,John,Khaled,Maëlis,Médhi,...,Alice,Antoinne,Bob,Carinne,Charline,Etienne,John,Khaled,Maëlis,Médhi
Sujet,Maths,Maths,Maths,Maths,Maths,Maths,Maths,Maths,Maths,Maths,...,Science,Science,Science,Science,Science,Science,Science,Science,Science,Science
Score,85,69,90,53,69,95,87,74,86,85,...,88,50,92,57,86,76,51,59,64,75